class JobData {
  static const Map<String, List<String>> jobs = {
    '귀검사(남)': ['버서커', '소드마스터', '웨펀마스터', '다크나이트', '검신'],
    '귀검사(여)': ['소드마스터', '다크템플러', '데몬슬레이어', '블레이드'],
    '거너(남)': ['레인저', '런처', '스핏파이어', '메카닉'],
    '거너(여)': ['레인저', '런처', '스핏파이어', '메카닉'],

    '격투가(남)': ['넨마스터', '스트리트파이터', '그래플러', '스트라이커'],
    '격투가(여)': ['넨마스터', '스트리트파이터', '그래플러', '스트라이커'],

    '마법사(남)': ['엘레멘탈바머', '빙결사', '블러드메이지'],
    '마법사(여)': ['엘레멘탈마스터', '소환사', '마도학자', '엔CHANTRESS'],
    '도적': ['로그', '사령술사', '쿠노이치', '섀도우댄서'],

    '프리스트(남)': ['인파이터', '크루세이더', '퇴마사', '어벤저'],
    '프리스트(여)': ['크루세이더', '인파이터'],

    '나이트': ['엘븐나이트', '카오스', '드래곤나이트', '팔라딘'],
    '마창사': ['듀얼리스트', '드래고니안랜서', '뱅가드'],
    '총검사': ['트러블슈터', '히트맨', '스페셜리스트', '요원'],
    '외전': ['다크나이트', '크리에이터'],
    '야차': ['혼백사'],
  };

  static List<String> getJobs() => jobs.keys.toList();

  static List<String> getAwakenings(String? job) =>
      job == null ? [] : (jobs[job] ?? []);
}
